package com.exemple.analyze;

public class CodeAnalyzer {

    /**
     * Метод должен:
     * - определить, какого класса объект ему передали и вывести название класса в консоль
     * - определить названия всех полей этого класса, включая приватные, и вывести их в консоль
     * - определить названия всех методов этого класса, включая приватные, и вывести их в консоль
     *
     * @param o - объект для анализа
     */
    public static void analyzeClass(Object o) {
        // необходима реализация
    }
}
